---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.DocumentOpeningEventArgs
source: html/a1b751b0-62f5-1bf6-28b6-6611619795f2.htm
---
# DocumentOpeningEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.